#include <iostream>
using namespace std;
static long long D[91][2]; // D[i][0], D[i][1] i자리 이친수중에서 마지막 자리가 0인경우와 1인경우
int main() {
    int N;
    cin>>N;
    // N자리 이친수 개수 출력
    // 첫자리 1 고정 두번째 자리 0 고정
    D[1][0]=0;
    D[1][1]=1;
    // D[2][0]=1;
    // D[2][1]=0;
    // D[2][0]=D[1][0]+D[1][1];
    // D[2][1]=D[1][0];
    // D[3][0]=D[2][0]+D[2][1];
    // D[3][1]=D[2][0];
    // D[4][0]=D[3][0]+D[3][1];
    // D[4][1]=D[3][0];
    // D[5][0]=D[4][0]+D[4][1];
    // D[5][1]=D[4][0];
    // D[4]= 앞자리가 1이 나오면 0, 0이 나왔으면 1,0 둘다 가능 -> 3 이 법칙이 계속 뒤로도 반복 -> dp
    for(int i=2;i<=N;i++){
        D[i][1]=D[i-1][0];
        D[i][0]=D[i-1][0]+D[i-1][1];
    }
    
    cout<<D[N][0] + D[N][1]<<"\n";
}